app/controllers/school_classes_controller.rb

def create
    school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ex"], ["room_number", 0], ["created_at", "2019-09-01 06:53:44.794770"], ["updated_at", "2019-09-01 06:53:44.794770"]]

def show
    @school_class = SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def edit
    @school_class = SchoolClass.find params[:id]
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

def update
    @school_class = SchoolClass.find params[:id]
    @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Hello!"], ["room_number", 2], ["updated_at", "2019-09-01 07:08:19.492318"], ["id", 2]]