app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Billy"], ["last_name", "Joe"], ["updated_at", "2019-09-02 14:03:38.222439"], ["id", 6]]
---
  def update
    @student.update(student_params)